In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Series

In [14]:
list = [1,2,3,4,5,6]
series = pd.Series(list)
list

[1, 2, 3, 4, 5, 6]

### Pandas

In [3]:
dict = {
    'enroll':[88,90,13],
    'name':["prem","sargara","rajesh"]
}
df = pd.DataFrame(dict, index=dict['enroll'])
df

    enroll     name
88      88     prem
90      90  sargara
13      13   rajesh

### Read csv

In [4]:
data = {
    'name':["prem"],
    'enroll':[88]
}
df = pd.DataFrame(data)
df.to_csv('/workspace/Machine_learning_notes/dataset/file.csv')
print(pd.read_csv('/workspace/Machine_learning_notes/dataset/file.csv'))

   Unnamed: 0  name  enroll
0           0  prem      88

In [10]:
data = {
    'name':["prem",np.nan,"sargara"],
    'enroll':[88,np.nan,90]
}
df = pd.DataFrame(data,index=data['enroll'])
df.to_csv('/workspace/Machine_learning_notes/dataset/file.csv')
df

         name  enroll
88.0     prem    88.0
NaN       NaN     NaN
90.0  sargara    90.0

<dl>
  <dt>Data cleaning</dt>
  <dd>data cleaning is a process of deleting null value or unwanted value that could impact on data accuracy and complexity</dd>
</dl>

In [9]:
df1 = df.dropna()
# df1.dropna(inplace=True)
df1

         name  enroll
88.0     prem    88.0
90.0  sargara    90.0